Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ64GC010.h
extern volatile U1EP11BITS U1EP11bits __attribute__((__sfr__));

#define U1EP12 U1EP12
extern volatile unsigned int  U1EP12 __attribute__((__sfr__));
__extension__ typedef struct tagU1EP12BITS {
  union {
    struct {
      unsigned EPHSHK:1;
      unsigned EPSTALL:1;
      unsigned EPTXEN:1;
      unsigned EPRXEN:1;
      unsigned EPCONDIS:1;
    };
    struct {
      unsigned :2;
      unsigned EPINEN:1;
      unsigned EPOUTEN:1;
    };
  };
} U1EP12BITS;
extern volatile U1EP12BITS U1EP12bits __attribute__((__sfr__));

#define U1EP13 U1EP13
extern volatile unsigned int  U1EP13 __attribute__((__sfr__));
__extension__ typedef struct tagU1EP13BITS {
  union {
    struct {
      unsigned EPHSHK:1;
      unsigned EPSTALL:1;
      unsigned EPTXEN:1;
      unsigned EPRXEN:1;
      unsigned EPCONDIS:1;
    };
    struct {
      unsigned :2;
      unsigned EPINEN:1;
      unsigned EPOUTEN:1;
    };
  };
} U1EP13BITS;
extern volatile U1EP13BITS U1EP13bits __attribute__((__sfr__));

#define U1EP14 U1EP14
extern volatile unsigned int  U1EP14 __attribute__((__sfr__));
__extension__ typedef struct tagU1EP14BITS {
  union {
    struct {
      unsigned EPHSHK:1;
      unsigned EPSTALL:1;
      unsigned EPTXEN:1;
      unsigned EPRXEN:1;
      unsigned EPCONDIS:1;
    };
    struct {
      unsigned :2;
      unsigned EPINEN:1;
      unsigned EPOUTEN:1;
    };
  };
} U1EP14BITS;
extern volatile U1EP14BITS U1EP14bits __attribute__((__sfr__));

#define U1EP15 U1EP15
extern volatile unsigned int  U1EP15 __attribute__((__sfr__));
__extension__ typedef struct tagU1EP15BITS {
  union {
    struct {
      unsigned EPHSHK:1;
      unsigned EPSTALL:1;
      unsigned EPTXEN:1;
      unsigned EPRXEN:1;
      unsigned EPCONDIS:1;
    };
    struct {
      unsigned :2;
      unsigned EPINEN:1;
      unsigned EPOUTEN:1;
    };
  };
} U1EP15BITS;
extern volatile U1EP15BITS U1EP15bits __attribute__((__sfr__));

#define SD1CON1 SD1CON1
extern volatile unsigned int  SD1CON1 __attribute__((__sfr__));
__extension__ typedef struct tagSD1CON1BITS {
  union {
    struct {
      unsigned PWRLVL:1;
      unsigned SDREFP:1;
      unsigned SDREFN:1;
      unsigned :1;
      unsigned VOSCAL:1;
      unsigned :1;
      unsigned DITHER:2;
      unsigned SDGAIN:3;
      unsigned FILTDIS:1;
      unsigned SDRST:1;
      unsigned SDSIDL:1;
      unsigned :1;
      unsigned SDON:1;
    };
    struct {
      unsigned :6;
      unsigned DITHER0:1;
      unsigned DITHER1:1;
      unsigned SDGAIN0:1;
      unsigned SDGAIN1:1;
      unsigned SDGAIN2:1;
    };
  };
} SD1CON1BITS;
extern volatile SD1CON1BITS SD1CON1bits __attribute__((__sfr__));

#define SD1CON2 SD1CON2
extern volatile unsigned int  SD1CON2 __attribute__((__sfr__));
__extension__ typedef struct tagSD1CON2BITS {
  union {
    struct {
      unsigned SDRDY:1;
      unsigned :2;
      unsigned RNDRES:2;
      unsigned :3;
      unsigned SDWM:2;
      unsigned :2;
      unsigned SDINT:2;
      unsigned CHOP:2;
    };
    struct {
      unsigned :3;
      unsigned RNDRES0:1;
      unsigned RNDRES1:1;
      unsigned :3;
      unsigned SDWM0:1;
      unsigned SDWM1:1;
      unsigned :2;
      unsigned SDINT0:1;
      unsigned SDINT1:1;
      unsigned CHOP0:1;
      unsigned CHOP1:1;
    };
  };
} SD1CON2BITS;
extern volatile SD1CON2BITS SD1CON2bits __attribute__((__sfr__));

#define SD1CON3 SD1CON3
extern volatile unsigned int  SD1CON3 __attribute__((__sfr__));
__extension__ typedef struct tagSD1CON3BITS {
  union {
    struct {
      unsigned SDCH:3;
      unsigned :5;
      unsigned SDCS:2;
      unsigned SDOSR:3;
      unsigned SDDIV:3;
    };
    struct {
      unsigned SDCH0:1;
      unsigned SDCH1:1;
      unsigned SDCH2:1;
      unsigned :5;
      unsigned SDCS0:1;
      unsigned SDCS1:1;
      unsigned SDOSR0:1;
      unsigned SDOSR1:1;
      unsigned SDOSR2:1;
      unsigned SDDIV0:1;
      unsigned SDDIV1:1;
      unsigned SDDIV2:1;
    };
  };
} SD1CON3BITS;
extern volatile SD1CON3BITS SD1CON3bits __attribute__((__sfr__));

#define SD1RESH SD1RESH
extern volatile unsigned int  SD1RESH __attribute__((__sfr__));
#define SD1RESL SD1RESL
extern volatile unsigned int  SD1RESL __attribute__((__sfr__));
#define ANCFG ANCFG
extern volatile unsigned int  ANCFG __attribute__((__sfr__));
typedef struct tagANCFGBITS {
  unsigned :2;
  unsigned VBG2EN:1;
} ANCFGBITS;
extern volatile ANCFGBITS ANCFGbits __attribute__((__sfr__));

#define ANSA ANSA
extern volatile unsigned int  ANSA __attribute__((__sfr__));
typedef struct tagANSABITS {
  unsigned :1;
  unsigned ANSA1:1;
  unsigned ANSA2:1;
  unsigned :1;
  unsigned ANSA4:1;
  unsigned ANSA5:1;
  unsigned ANSA6:1;
  unsigned ANSA7:1;
  unsigned :1;
  unsigned ANSA9:1;
  unsigned ANSA10:1;
  unsigned :3;
  unsigned ANSA14:1;
  unsigned ANSA15:1;
} ANSABITS;
extern volatile ANSABITS ANSAbits __attribute__((__sfr__));

#define ANSB ANSB
extern volatile unsigned int  ANSB __attribute__((__sfr__));
typedef struct tagANSBBITS {
  unsigned ANSB0:1;
  unsigned ANSB1:1;
  unsigned ANSB2:1;
  unsigned ANSB3:1;
  unsigned ANSB4:1;
  unsigned ANSB5:1;
  unsigned ANSB6:1;
  unsigned ANSB7:1;
  unsigned :4;
  unsigned ANSB12:1;
  unsigned ANSB13:1;
  unsigned ANSB14:1;
  unsigned ANSB15:1;
} ANSBBITS;
extern volatile ANSBBITS ANSBbits __attribute__((__sfr__));

#define ANSC ANSC
extern volatile unsigned int  ANSC __attribute__((__sfr__));
typedef struct tagANSCBITS {
  unsigned :1;
  unsigned ANSC1:1;
  unsigned :1;
  unsigned ANSC3:1;
  unsigned ANSC4:1;
} ANSCBITS;
extern volatile ANSCBITS ANSCbits __attribute__((__sfr__));

#define ANSD ANSD
extern volatile unsigned int  ANSD __attribute__((__sfr__));
typedef struct tagANSDBITS {
  unsigned ANSD0:1;
  unsigned ANSD1:1;
  unsigned ANSD2:1;
  unsigned ANSD3:1;
  unsigned ANSD4:1;
  unsigned ANSD5:1;
  unsigned ANSD6:1;
  unsigned ANSD7:1;
  unsigned ANSD8:1;
  unsigned ANSD9:1;
  unsigned ANSD10:1;
  unsigned ANSD11:1;
  unsigned ANSD12:1;
  unsigned ANSD13:1;
  unsigned ANSD14:1;
  unsigned ANSD15:1;
} ANSDBITS;
extern volatile ANSDBITS ANSDbits __attribute__((__sfr__));

#define ANSE ANSE
extern volatile unsigned int  ANSE __attribute__((__sfr__));
typedef struct tagANSEBITS {
  unsigned :4;
  unsigned ANSE4:1;
  unsigned ANSE5:1;
  unsigned ANSE6:1;
  unsigned ANSE7:1;
  unsigned :1;
  unsigned ANSE9:1;
} ANSEBITS;
extern volatile ANSEBITS ANSEbits __attribute__((__sfr__));

#define ANSF ANSF
extern volatile unsigned int  ANSF __attribute__((__sfr__));
typedef struct tagANSFBITS {
  unsigned ANSF0:1;
  unsigned :1;
  unsigned ANSF2:1;
  unsigned ANSF3:1;
  unsigned ANSF4:1;
  unsigned ANSF5:1;
  unsigned :1;
  unsigned ANSF7:1;
  unsigned ANSF8:1;
  unsigned :4;
  unsigned ANSF13:1;
} ANSFBITS;
