Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ64GC010.h
extern volatile ADTH2HBITS ADTH2Hbits __attribute__((__sfr__));

#define ADL2MSEL ADL2MSEL
extern volatile unsigned long long ADL2MSEL __attribute__((__sfr__));
#define ADL2MSEL0 ADL2MSEL0
extern volatile unsigned int  ADL2MSEL0 __attribute__((__sfr__));
typedef struct tagADL2MSEL0BITS {
  unsigned :15;
  unsigned MSEL15:1;
} ADL2MSEL0BITS;
extern volatile ADL2MSEL0BITS ADL2MSEL0bits __attribute__((__sfr__));

#define ADL2MSEL1 ADL2MSEL1
extern volatile unsigned int  ADL2MSEL1 __attribute__((__sfr__));
typedef struct tagADL2MSEL1BITS {
  unsigned MSEL16:1;
  unsigned MSEL17:1;
  unsigned MSEL18:1;
  unsigned MSEL19:1;
  unsigned MSEL20:1;
  unsigned MSEL21:1;
  unsigned MSEL22:1;
  unsigned MSEL23:1;
  unsigned MSEL24:1;
  unsigned MSEL25:1;
  unsigned MSEL26:1;
  unsigned MSEL27:1;
  unsigned MSEL28:1;
  unsigned MSEL29:1;
  unsigned MSEL30:1;
  unsigned MSEL31:1;
} ADL2MSEL1BITS;
extern volatile ADL2MSEL1BITS ADL2MSEL1bits __attribute__((__sfr__));

#define ADL2MSEL2 ADL2MSEL2
extern volatile unsigned int  ADL2MSEL2 __attribute__((__sfr__));
typedef struct tagADL2MSEL2BITS {
  unsigned MSEL32:1;
  unsigned MSEL33:1;
  unsigned MSEL34:1;
  unsigned MSEL35:1;
  unsigned MSEL36:1;
  unsigned MSEL37:1;
  unsigned MSEL38:1;
  unsigned MSEL39:1;
  unsigned MSEL40:1;
  unsigned MSEL41:1;
  unsigned MSEL42:1;
  unsigned MSEL43:1;
  unsigned MSEL44:1;
  unsigned MSEL45:1;
  unsigned MSEL46:1;
  unsigned MSEL47:1;
} ADL2MSEL2BITS;
extern volatile ADL2MSEL2BITS ADL2MSEL2bits __attribute__((__sfr__));

#define ADL2MSEL3 ADL2MSEL3
extern volatile unsigned int  ADL2MSEL3 __attribute__((__sfr__));
typedef struct tagADL2MSEL3BITS {
  unsigned MSEL48:1;
  unsigned MSEL49:1;
} ADL2MSEL3BITS;
extern volatile ADL2MSEL3BITS ADL2MSEL3bits __attribute__((__sfr__));

#define LCDREG LCDREG
extern volatile unsigned int  LCDREG __attribute__((__sfr__));
__extension__ typedef struct tagLCDREGBITS {
  union {
    struct {
      unsigned CKSEL:2;
      unsigned MODE13:1;
      unsigned BIAS:3;
      unsigned :9;
      unsigned CPEN:1;
    };
    struct {
      unsigned CKSEL0:1;
      unsigned CKSEL1:1;
      unsigned :1;
      unsigned BIAS0:1;
      unsigned BIAS1:1;
      unsigned BIAS2:1;
    };
  };
} LCDREGBITS;
extern volatile LCDREGBITS LCDREGbits __attribute__((__sfr__));

#define LCDREF LCDREF
extern volatile unsigned int  LCDREF __attribute__((__sfr__));
__extension__ typedef struct tagLCDREFBITS {
  union {
    struct {
      unsigned LRLAT:3;
      unsigned :1;
      unsigned LRLBP:2;
      unsigned LRLAP:2;
      unsigned VLCD1PE:1;
      unsigned VLCD2PE:1;
      unsigned VLCD3PE:1;
      unsigned LCDCST:3;
      unsigned :1;
      unsigned LCDIRE:1;
    };
    struct {
      unsigned LRLAT0:1;
      unsigned LRLAT1:1;
      unsigned LRLAT2:1;
      unsigned :1;
      unsigned LRLBP0:1;
      unsigned LRLBP1:1;
      unsigned LRLAP0:1;
      unsigned LRLAP1:1;
      unsigned :3;
      unsigned LCDCST0:1;
      unsigned LCDCST1:1;
      unsigned LCDCST2:1;
    };
  };
} LCDREFBITS;
extern volatile LCDREFBITS LCDREFbits __attribute__((__sfr__));

#define LCDCON LCDCON
extern volatile unsigned int  LCDCON __attribute__((__sfr__));
__extension__ typedef struct tagLCDCONBITS {
  union {
    struct {
      unsigned LMUX:3;
      unsigned CS:2;
      unsigned WERR:1;
      unsigned SLPEN:1;
      unsigned :6;
      unsigned LCDSIDL:1;
      unsigned :1;
      unsigned LCDEN:1;
    };
    struct {
      unsigned LMUX0:1;
      unsigned LMUX1:1;
      unsigned LMUX2:1;
      unsigned CS0:1;
      unsigned CS1:1;
    };
  };
} LCDCONBITS;
extern volatile LCDCONBITS LCDCONbits __attribute__((__sfr__));

#define LCDPS LCDPS
extern volatile unsigned int  LCDPS __attribute__((__sfr__));
__extension__ typedef struct tagLCDPSBITS {
  union {
    struct {
      unsigned LP:4;
      unsigned WA:1;
      unsigned LCDA:1;
      unsigned BIASMD:1;
      unsigned WFT:1;
    };
    struct {
      unsigned LP0:1;
      unsigned LP1:1;
      unsigned LP2:1;
      unsigned LP3:1;
    };
  };
} LCDPSBITS;
extern volatile LCDPSBITS LCDPSbits __attribute__((__sfr__));

#define LCDSE0 LCDSE0
extern volatile unsigned int  LCDSE0 __attribute__((__sfr__));
typedef struct tagLCDSE0BITS {
  unsigned SE00:1;
  unsigned SE01:1;
  unsigned SE02:1;
  unsigned SE03:1;
  unsigned SE04:1;
  unsigned SE05:1;
  unsigned SE06:1;
  unsigned SE07:1;
  unsigned SE08:1;
  unsigned SE09:1;
  unsigned SE10:1;
  unsigned SE11:1;
  unsigned SE12:1;
  unsigned SE13:1;
  unsigned SE14:1;
  unsigned SE15:1;
} LCDSE0BITS;
extern volatile LCDSE0BITS LCDSE0bits __attribute__((__sfr__));

#define LCDSE1 LCDSE1
extern volatile unsigned int  LCDSE1 __attribute__((__sfr__));
typedef struct tagLCDSE1BITS {
  unsigned SE16:1;
  unsigned SE17:1;
  unsigned SE18:1;
  unsigned SE19:1;
  unsigned SE20:1;
  unsigned SE21:1;
  unsigned SE22:1;
  unsigned SE23:1;
  unsigned SE24:1;
  unsigned SE25:1;
  unsigned SE26:1;
  unsigned SE27:1;
  unsigned SE28:1;
  unsigned SE29:1;
  unsigned SE30:1;
  unsigned SE31:1;
} LCDSE1BITS;
extern volatile LCDSE1BITS LCDSE1bits __attribute__((__sfr__));

#define LCDSE2 LCDSE2
extern volatile unsigned int  LCDSE2 __attribute__((__sfr__));
typedef struct tagLCDSE2BITS {
  unsigned SE32:1;
  unsigned SE33:1;
  unsigned SE34:1;
  unsigned SE35:1;
  unsigned SE36:1;
  unsigned SE37:1;
  unsigned SE38:1;
  unsigned SE39:1;
  unsigned SE40:1;
  unsigned SE41:1;
  unsigned SE42:1;
  unsigned SE43:1;
  unsigned SE44:1;
  unsigned SE45:1;
  unsigned SE46:1;
  unsigned SE47:1;
} LCDSE2BITS;
extern volatile LCDSE2BITS LCDSE2bits __attribute__((__sfr__));

#define LCDSE3 LCDSE3
extern volatile unsigned int  LCDSE3 __attribute__((__sfr__));
typedef struct tagLCDSE3BITS {
  unsigned SE48:1;
  unsigned SE49:1;
  unsigned SE50:1;
  unsigned SE51:1;
  unsigned SE52:1;
  unsigned SE53:1;
  unsigned SE54:1;
  unsigned SE55:1;
  unsigned SE56:1;
  unsigned SE57:1;
  unsigned SE58:1;
  unsigned SE59:1;
  unsigned SE60:1;
  unsigned SE61:1;
  unsigned SE62:1;
  unsigned SE63:1;
} LCDSE3BITS;
extern volatile LCDSE3BITS LCDSE3bits __attribute__((__sfr__));

#define LCDDATA0 LCDDATA0
extern volatile unsigned int  LCDDATA0 __attribute__((__sfr__));
typedef struct tagLCDDATA0BITS {
  unsigned S0C0:1;
  unsigned S1C0:1;
  unsigned S2C0:1;
  unsigned S3C0:1;
  unsigned S4C0:1;
  unsigned S5C0:1;
  unsigned S6C0:1;
  unsigned S7C0:1;
  unsigned S8C0:1;
  unsigned S9C0:1;
  unsigned S10C0:1;
  unsigned S11C0:1;
  unsigned S12C0:1;
  unsigned S13C0:1;
  unsigned S14C0:1;
  unsigned S15C0:1;
} LCDDATA0BITS;
extern volatile LCDDATA0BITS LCDDATA0bits __attribute__((__sfr__));

#define LCDDATA1 LCDDATA1
extern volatile unsigned int  LCDDATA1 __attribute__((__sfr__));
typedef struct tagLCDDATA1BITS {
  unsigned S16C0:1;
  unsigned S17C0:1;
  unsigned S18C0:1;
  unsigned S19C0:1;
  unsigned S20C0:1;
  unsigned S21C0:1;
  unsigned S22C0:1;
  unsigned S23C0:1;
  unsigned S24C0:1;
  unsigned S25C0:1;
  unsigned S26C0:1;
  unsigned S27C0:1;
  unsigned S28C0:1;
  unsigned S29C0:1;
  unsigned S30C0:1;
  unsigned S31C0:1;
} LCDDATA1BITS;
extern volatile LCDDATA1BITS LCDDATA1bits __attribute__((__sfr__));

#define LCDDATA2 LCDDATA2
extern volatile unsigned int  LCDDATA2 __attribute__((__sfr__));
typedef struct tagLCDDATA2BITS {
  unsigned S32C0:1;
  unsigned S33C0:1;
  unsigned S34C0:1;
  unsigned S35C0:1;
  unsigned S36C0:1;
  unsigned S37C0:1;
  unsigned S38C0:1;
  unsigned S39C0:1;
  unsigned S40C0:1;
  unsigned S41C0:1;
  unsigned S42C0:1;
  unsigned S43C0:1;
  unsigned S44C0:1;
  unsigned S45C0:1;
  unsigned S46C0:1;
  unsigned S47C0:1;
} LCDDATA2BITS;
extern volatile LCDDATA2BITS LCDDATA2bits __attribute__((__sfr__));

#define LCDDATA3 LCDDATA3
extern volatile unsigned int  LCDDATA3 __attribute__((__sfr__));
typedef struct tagLCDDATA3BITS {
  unsigned S48C0:1;
  unsigned S49C0:1;
  unsigned S50C0:1;
  unsigned S51C0:1;
  unsigned S52C0:1;
  unsigned S53C0:1;
  unsigned S54C0:1;
  unsigned S55C0:1;
  unsigned S56C0:1;
  unsigned S57C0:1;
  unsigned S58C0:1;
  unsigned S59C0:1;
  unsigned S60C0:1;
  unsigned S61C0:1;
  unsigned S62C0:1;
  unsigned S63C0:1;
} LCDDATA3BITS;
