Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ64GC010.h
/* LATD */
#define _LATD0 LATDbits.LATD0
#define _LATD1 LATDbits.LATD1
#define _LATD2 LATDbits.LATD2
#define _LATD3 LATDbits.LATD3
#define _LATD4 LATDbits.LATD4
#define _LATD5 LATDbits.LATD5
#define _LATD6 LATDbits.LATD6
#define _LATD7 LATDbits.LATD7
#define _LATD8 LATDbits.LATD8
#define _LATD9 LATDbits.LATD9
#define _LATD10 LATDbits.LATD10
#define _LATD11 LATDbits.LATD11
#define _LATD12 LATDbits.LATD12
#define _LATD13 LATDbits.LATD13
#define _LATD14 LATDbits.LATD14
#define _LATD15 LATDbits.LATD15

/* ODCD */
#define _ODD0 ODCDbits.ODD0
#define _ODD1 ODCDbits.ODD1
#define _ODD2 ODCDbits.ODD2
#define _ODD3 ODCDbits.ODD3
#define _ODD4 ODCDbits.ODD4
#define _ODD5 ODCDbits.ODD5
#define _ODD6 ODCDbits.ODD6
#define _ODD7 ODCDbits.ODD7
#define _ODD8 ODCDbits.ODD8
#define _ODD9 ODCDbits.ODD9
#define _ODD10 ODCDbits.ODD10
#define _ODD11 ODCDbits.ODD11
#define _ODD12 ODCDbits.ODD12
#define _ODD13 ODCDbits.ODD13
#define _ODD14 ODCDbits.ODD14
#define _ODD15 ODCDbits.ODD15

/* TRISE */
#define _TRISE0 TRISEbits.TRISE0
#define _TRISE1 TRISEbits.TRISE1
#define _TRISE2 TRISEbits.TRISE2
#define _TRISE3 TRISEbits.TRISE3
#define _TRISE4 TRISEbits.TRISE4
#define _TRISE5 TRISEbits.TRISE5
#define _TRISE6 TRISEbits.TRISE6
#define _TRISE7 TRISEbits.TRISE7
#define _TRISE8 TRISEbits.TRISE8
#define _TRISE9 TRISEbits.TRISE9

/* PORTE */
#define _RE0 PORTEbits.RE0
#define _RE1 PORTEbits.RE1
#define _RE2 PORTEbits.RE2
#define _RE3 PORTEbits.RE3
#define _RE4 PORTEbits.RE4
#define _RE5 PORTEbits.RE5
#define _RE6 PORTEbits.RE6
#define _RE7 PORTEbits.RE7
#define _RE8 PORTEbits.RE8
#define _RE9 PORTEbits.RE9

/* LATE */
#define _LATE0 LATEbits.LATE0
#define _LATE1 LATEbits.LATE1
#define _LATE2 LATEbits.LATE2
#define _LATE3 LATEbits.LATE3
#define _LATE4 LATEbits.LATE4
#define _LATE5 LATEbits.LATE5
#define _LATE6 LATEbits.LATE6
#define _LATE7 LATEbits.LATE7
#define _LATE8 LATEbits.LATE8
#define _LATE9 LATEbits.LATE9

/* ODCE */
#define _ODE0 ODCEbits.ODE0
#define _ODE1 ODCEbits.ODE1
#define _ODE2 ODCEbits.ODE2
#define _ODE3 ODCEbits.ODE3
#define _ODE4 ODCEbits.ODE4
#define _ODE5 ODCEbits.ODE5
#define _ODE6 ODCEbits.ODE6
#define _ODE7 ODCEbits.ODE7
#define _ODE8 ODCEbits.ODE8
#define _ODE9 ODCEbits.ODE9

/* TRISF */
#define _TRISF0 TRISFbits.TRISF0
#define _TRISF1 TRISFbits.TRISF1
#define _TRISF2 TRISFbits.TRISF2
#define _TRISF3 TRISFbits.TRISF3
#define _TRISF4 TRISFbits.TRISF4
#define _TRISF5 TRISFbits.TRISF5
#define _TRISF7 TRISFbits.TRISF7
#define _TRISF8 TRISFbits.TRISF8
#define _TRISF12 TRISFbits.TRISF12
#define _TRISF13 TRISFbits.TRISF13

/* PORTF */
#define _RF0 PORTFbits.RF0
#define _RF1 PORTFbits.RF1
#define _RF2 PORTFbits.RF2
#define _RF3 PORTFbits.RF3
#define _RF4 PORTFbits.RF4
#define _RF5 PORTFbits.RF5
#define _RF7 PORTFbits.RF7
#define _RF8 PORTFbits.RF8
#define _RF12 PORTFbits.RF12
#define _RF13 PORTFbits.RF13

/* LATF */
#define _LATF0 LATFbits.LATF0
#define _LATF1 LATFbits.LATF1
#define _LATF2 LATFbits.LATF2
#define _LATF3 LATFbits.LATF3
#define _LATF4 LATFbits.LATF4
#define _LATF5 LATFbits.LATF5
#define _LATF7 LATFbits.LATF7
#define _LATF8 LATFbits.LATF8
#define _LATF12 LATFbits.LATF12
#define _LATF13 LATFbits.LATF13

/* ODCF */
#define _ODF0 ODCFbits.ODF0
#define _ODF1 ODCFbits.ODF1
#define _ODF2 ODCFbits.ODF2
#define _ODF3 ODCFbits.ODF3
#define _ODF4 ODCFbits.ODF4
#define _ODF5 ODCFbits.ODF5
#define _ODF7 ODCFbits.ODF7
#define _ODF8 ODCFbits.ODF8
#define _ODF12 ODCFbits.ODF12
#define _ODF13 ODCFbits.ODF13

/* TRISG */
#define _TRISG0 TRISGbits.TRISG0
#define _TRISG1 TRISGbits.TRISG1
#define _TRISG2 TRISGbits.TRISG2
#define _TRISG3 TRISGbits.TRISG3
#define _TRISG6 TRISGbits.TRISG6
#define _TRISG7 TRISGbits.TRISG7
#define _TRISG8 TRISGbits.TRISG8
#define _TRISG9 TRISGbits.TRISG9
#define _TRISG12 TRISGbits.TRISG12
#define _TRISG13 TRISGbits.TRISG13
#define _TRISG14 TRISGbits.TRISG14
#define _TRISG15 TRISGbits.TRISG15

/* PORTG */
#define _RG0 PORTGbits.RG0
#define _RG1 PORTGbits.RG1
#define _RG2 PORTGbits.RG2
#define _RG3 PORTGbits.RG3
#define _RG6 PORTGbits.RG6
#define _RG7 PORTGbits.RG7
#define _RG8 PORTGbits.RG8
#define _RG9 PORTGbits.RG9
#define _RG12 PORTGbits.RG12
#define _RG13 PORTGbits.RG13
#define _RG14 PORTGbits.RG14
#define _RG15 PORTGbits.RG15

/* LATG */
#define _LATG0 LATGbits.LATG0
#define _LATG1 LATGbits.LATG1
#define _LATG2 LATGbits.LATG2
#define _LATG3 LATGbits.LATG3
#define _LATG6 LATGbits.LATG6
#define _LATG7 LATGbits.LATG7
#define _LATG8 LATGbits.LATG8
#define _LATG9 LATGbits.LATG9
#define _LATG12 LATGbits.LATG12
#define _LATG13 LATGbits.LATG13
#define _LATG14 LATGbits.LATG14
#define _LATG15 LATGbits.LATG15

/* ODCG */
#define _ODG0 ODCGbits.ODG0
#define _ODG1 ODCGbits.ODG1
#define _ODG2 ODCGbits.ODG2
#define _ODG3 ODCGbits.ODG3
#define _ODG6 ODCGbits.ODG6
#define _ODG7 ODCGbits.ODG7
#define _ODG8 ODCGbits.ODG8
#define _ODG9 ODCGbits.ODG9
#define _ODG12 ODCGbits.ODG12
#define _ODG13 ODCGbits.ODG13
#define _ODG14 ODCGbits.ODG14
#define _ODG15 ODCGbits.ODG15

/* PADCFG1 */
#define _PMPTTL PADCFG1bits.PMPTTL

/* ADTBL0 */
/* Bitname _ADCH cannot be defined because it is used by more than one SFR */
/* Bitname _DIFF cannot be defined because it is used by more than one SFR */
/* Bitname _UCTMU cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH0 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH4 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH5 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH6 cannot be defined because it is used by more than one SFR */

/* ADTBL1 */
/* Bitname _ADCH cannot be defined because it is used by more than one SFR */
/* Bitname _DIFF cannot be defined because it is used by more than one SFR */
/* Bitname _UCTMU cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH0 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH4 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH5 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH6 cannot be defined because it is used by more than one SFR */

/* ADTBL2 */
/* Bitname _ADCH cannot be defined because it is used by more than one SFR */
/* Bitname _DIFF cannot be defined because it is used by more than one SFR */
/* Bitname _UCTMU cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH0 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH4 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH5 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH6 cannot be defined because it is used by more than one SFR */

/* ADTBL3 */
/* Bitname _ADCH cannot be defined because it is used by more than one SFR */
/* Bitname _DIFF cannot be defined because it is used by more than one SFR */
/* Bitname _UCTMU cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH0 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH4 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH5 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH6 cannot be defined because it is used by more than one SFR */

/* ADTBL4 */
/* Bitname _ADCH cannot be defined because it is used by more than one SFR */
/* Bitname _DIFF cannot be defined because it is used by more than one SFR */
/* Bitname _UCTMU cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH0 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH4 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH5 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH6 cannot be defined because it is used by more than one SFR */

/* ADTBL5 */
/* Bitname _ADCH cannot be defined because it is used by more than one SFR */
/* Bitname _DIFF cannot be defined because it is used by more than one SFR */
/* Bitname _UCTMU cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH0 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH4 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH5 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH6 cannot be defined because it is used by more than one SFR */

/* ADTBL6 */
/* Bitname _ADCH cannot be defined because it is used by more than one SFR */
/* Bitname _DIFF cannot be defined because it is used by more than one SFR */
/* Bitname _UCTMU cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH0 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH4 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH5 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCH6 cannot be defined because it is used by more than one SFR */

