Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ64GC010.h
#define _DMACH5_DAMODE1_POSITION                 0x00000005
#define _DMACH5_DAMODE1_MASK                     0x00000020
#define _DMACH5_DAMODE1_LENGTH                   0x00000001

#define _DMACH5_SAMODE0_POSITION                 0x00000006
#define _DMACH5_SAMODE0_MASK                     0x00000040
#define _DMACH5_SAMODE0_LENGTH                   0x00000001

#define _DMACH5_SAMODE1_POSITION                 0x00000007
#define _DMACH5_SAMODE1_MASK                     0x00000080
#define _DMACH5_SAMODE1_LENGTH                   0x00000001

#define _DMAINT5_HALFEN_POSITION                 0x00000000
#define _DMAINT5_HALFEN_MASK                     0x00000001
#define _DMAINT5_HALFEN_LENGTH                   0x00000001

#define _DMAINT5_OVRUNIF_POSITION                0x00000003
#define _DMAINT5_OVRUNIF_MASK                    0x00000008
#define _DMAINT5_OVRUNIF_LENGTH                  0x00000001

#define _DMAINT5_HALFIF_POSITION                 0x00000004
#define _DMAINT5_HALFIF_MASK                     0x00000010
#define _DMAINT5_HALFIF_LENGTH                   0x00000001

#define _DMAINT5_DONEIF_POSITION                 0x00000005
#define _DMAINT5_DONEIF_MASK                     0x00000020
#define _DMAINT5_DONEIF_LENGTH                   0x00000001

#define _DMAINT5_LOWIF_POSITION                  0x00000006
#define _DMAINT5_LOWIF_MASK                      0x00000040
#define _DMAINT5_LOWIF_LENGTH                    0x00000001

#define _DMAINT5_HIGHIF_POSITION                 0x00000007
#define _DMAINT5_HIGHIF_MASK                     0x00000080
#define _DMAINT5_HIGHIF_LENGTH                   0x00000001

#define _DMAINT5_CHSEL_POSITION                  0x00000008
#define _DMAINT5_CHSEL_MASK                      0x00003F00
#define _DMAINT5_CHSEL_LENGTH                    0x00000006

#define _DMAINT5_DBUFWF_POSITION                 0x0000000F
#define _DMAINT5_DBUFWF_MASK                     0x00008000
#define _DMAINT5_DBUFWF_LENGTH                   0x00000001

#define _DMAINT5_CHSEL0_POSITION                 0x00000008
#define _DMAINT5_CHSEL0_MASK                     0x00000100
#define _DMAINT5_CHSEL0_LENGTH                   0x00000001

#define _DMAINT5_CHSEL1_POSITION                 0x00000009
#define _DMAINT5_CHSEL1_MASK                     0x00000200
#define _DMAINT5_CHSEL1_LENGTH                   0x00000001

#define _DMAINT5_CHSEL2_POSITION                 0x0000000A
#define _DMAINT5_CHSEL2_MASK                     0x00000400
#define _DMAINT5_CHSEL2_LENGTH                   0x00000001

#define _DMAINT5_CHSEL3_POSITION                 0x0000000B
#define _DMAINT5_CHSEL3_MASK                     0x00000800
#define _DMAINT5_CHSEL3_LENGTH                   0x00000001

#define _DMAINT5_CHSEL4_POSITION                 0x0000000C
#define _DMAINT5_CHSEL4_MASK                     0x00001000
#define _DMAINT5_CHSEL4_LENGTH                   0x00000001

#define _DMAINT5_CHSEL5_POSITION                 0x0000000D
#define _DMAINT5_CHSEL5_MASK                     0x00002000
#define _DMAINT5_CHSEL5_LENGTH                   0x00000001

#define _ADL3CONL_SLSIZE_POSITION                0x00000000
#define _ADL3CONL_SLSIZE_MASK                    0x0000003F
#define _ADL3CONL_SLSIZE_LENGTH                  0x00000006

#define _ADL3CONL_THSRC_POSITION                 0x00000007
#define _ADL3CONL_THSRC_MASK                     0x00000080
#define _ADL3CONL_THSRC_LENGTH                   0x00000001

#define _ADL3CONL_SLTSRC_POSITION                0x00000008
#define _ADL3CONL_SLTSRC_MASK                    0x00001F00
#define _ADL3CONL_SLTSRC_LENGTH                  0x00000005

#define _ADL3CONL_SLENCLR_POSITION               0x0000000D
#define _ADL3CONL_SLENCLR_MASK                   0x00002000
#define _ADL3CONL_SLENCLR_LENGTH                 0x00000001

#define _ADL3CONL_SAMP_POSITION                  0x0000000E
#define _ADL3CONL_SAMP_MASK                      0x00004000
#define _ADL3CONL_SAMP_LENGTH                    0x00000001

#define _ADL3CONL_SLEN_POSITION                  0x0000000F
#define _ADL3CONL_SLEN_MASK                      0x00008000
#define _ADL3CONL_SLEN_LENGTH                    0x00000001

#define _ADL3CONL_SLSIZE0_POSITION               0x00000000
#define _ADL3CONL_SLSIZE0_MASK                   0x00000001
#define _ADL3CONL_SLSIZE0_LENGTH                 0x00000001

#define _ADL3CONL_SLSIZE1_POSITION               0x00000001
#define _ADL3CONL_SLSIZE1_MASK                   0x00000002
#define _ADL3CONL_SLSIZE1_LENGTH                 0x00000001

#define _ADL3CONL_SLSIZE2_POSITION               0x00000002
#define _ADL3CONL_SLSIZE2_MASK                   0x00000004
#define _ADL3CONL_SLSIZE2_LENGTH                 0x00000001

#define _ADL3CONL_SLSIZE3_POSITION               0x00000003
#define _ADL3CONL_SLSIZE3_MASK                   0x00000008
#define _ADL3CONL_SLSIZE3_LENGTH                 0x00000001

#define _ADL3CONL_SLSIZE4_POSITION               0x00000004
#define _ADL3CONL_SLSIZE4_MASK                   0x00000010
#define _ADL3CONL_SLSIZE4_LENGTH                 0x00000001

#define _ADL3CONL_SLSIZE5_POSITION               0x00000005
#define _ADL3CONL_SLSIZE5_MASK                   0x00000020
#define _ADL3CONL_SLSIZE5_LENGTH                 0x00000001

#define _ADL3CONL_SLTSRC0_POSITION               0x00000008
#define _ADL3CONL_SLTSRC0_MASK                   0x00000100
#define _ADL3CONL_SLTSRC0_LENGTH                 0x00000001

#define _ADL3CONL_SLTSRC1_POSITION               0x00000009
#define _ADL3CONL_SLTSRC1_MASK                   0x00000200
#define _ADL3CONL_SLTSRC1_LENGTH                 0x00000001

#define _ADL3CONL_SLTSRC2_POSITION               0x0000000A
#define _ADL3CONL_SLTSRC2_MASK                   0x00000400
#define _ADL3CONL_SLTSRC2_LENGTH                 0x00000001

#define _ADL3CONL_SLTSRC3_POSITION               0x0000000B
#define _ADL3CONL_SLTSRC3_MASK                   0x00000800
#define _ADL3CONL_SLTSRC3_LENGTH                 0x00000001

#define _ADL3CONL_SLTSRC4_POSITION               0x0000000C
#define _ADL3CONL_SLTSRC4_MASK                   0x00001000
#define _ADL3CONL_SLTSRC4_LENGTH                 0x00000001

#define _ADL3CONH_SAMC_POSITION                  0x00000000
#define _ADL3CONH_SAMC_MASK                      0x0000001F
#define _ADL3CONH_SAMC_LENGTH                    0x00000005

