Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ64GC010.h
#define _DAC2CON_DACOE_POSITION                  0x00000007
#define _DAC2CON_DACOE_MASK                      0x00000080
#define _DAC2CON_DACOE_LENGTH                    0x00000001

#define _DAC2CON_DACTRIG_POSITION                0x00000008
#define _DAC2CON_DACTRIG_MASK                    0x00000100
#define _DAC2CON_DACTRIG_LENGTH                  0x00000001

#define _DAC2CON_DACFM_POSITION                  0x0000000B
#define _DAC2CON_DACFM_MASK                      0x00000800
#define _DAC2CON_DACFM_LENGTH                    0x00000001

#define _DAC2CON_DACSLP_POSITION                 0x0000000C
#define _DAC2CON_DACSLP_MASK                     0x00001000
#define _DAC2CON_DACSLP_LENGTH                   0x00000001

#define _DAC2CON_DACSIDL_POSITION                0x0000000D
#define _DAC2CON_DACSIDL_MASK                    0x00002000
#define _DAC2CON_DACSIDL_LENGTH                  0x00000001

#define _DAC2CON_DACEN_POSITION                  0x0000000F
#define _DAC2CON_DACEN_MASK                      0x00008000
#define _DAC2CON_DACEN_LENGTH                    0x00000001

#define _DAC2CON_REFSEL0_POSITION                0x00000000
#define _DAC2CON_REFSEL0_MASK                    0x00000001
#define _DAC2CON_REFSEL0_LENGTH                  0x00000001

#define _DAC2CON_REFSEL1_POSITION                0x00000001
#define _DAC2CON_REFSEL1_MASK                    0x00000002
#define _DAC2CON_REFSEL1_LENGTH                  0x00000001

#define _DAC2CON_DACTSEL0_POSITION               0x00000002
#define _DAC2CON_DACTSEL0_MASK                   0x00000004
#define _DAC2CON_DACTSEL0_LENGTH                 0x00000001

#define _DAC2CON_DACTSEL1_POSITION               0x00000003
#define _DAC2CON_DACTSEL1_MASK                   0x00000008
#define _DAC2CON_DACTSEL1_LENGTH                 0x00000001

#define _DAC2CON_DACTSEL2_POSITION               0x00000004
#define _DAC2CON_DACTSEL2_MASK                   0x00000010
#define _DAC2CON_DACTSEL2_LENGTH                 0x00000001

#define _DAC2CON_DACTSEL3_POSITION               0x00000005
#define _DAC2CON_DACTSEL3_MASK                   0x00000020
#define _DAC2CON_DACTSEL3_LENGTH                 0x00000001

#define _DAC2CON_DACTSEL4_POSITION               0x00000006
#define _DAC2CON_DACTSEL4_MASK                   0x00000040
#define _DAC2CON_DACTSEL4_LENGTH                 0x00000001

#define _U1OTGIR_VBUSVDIF_POSITION               0x00000000
#define _U1OTGIR_VBUSVDIF_MASK                   0x00000001
#define _U1OTGIR_VBUSVDIF_LENGTH                 0x00000001

#define _U1OTGIR_SESENDIF_POSITION               0x00000002
#define _U1OTGIR_SESENDIF_MASK                   0x00000004
#define _U1OTGIR_SESENDIF_LENGTH                 0x00000001

#define _U1OTGIR_SESVDIF_POSITION                0x00000003
#define _U1OTGIR_SESVDIF_MASK                    0x00000008
#define _U1OTGIR_SESVDIF_LENGTH                  0x00000001

#define _U1OTGIR_ACTVIF_POSITION                 0x00000004
#define _U1OTGIR_ACTVIF_MASK                     0x00000010
#define _U1OTGIR_ACTVIF_LENGTH                   0x00000001

#define _U1OTGIR_LSTATEIF_POSITION               0x00000005
#define _U1OTGIR_LSTATEIF_MASK                   0x00000020
#define _U1OTGIR_LSTATEIF_LENGTH                 0x00000001

#define _U1OTGIR_T1MSECIF_POSITION               0x00000006
#define _U1OTGIR_T1MSECIF_MASK                   0x00000040
#define _U1OTGIR_T1MSECIF_LENGTH                 0x00000001

#define _U1OTGIR_IDIF_POSITION                   0x00000007
#define _U1OTGIR_IDIF_MASK                       0x00000080
#define _U1OTGIR_IDIF_LENGTH                     0x00000001

#define _U1OTGIE_VBUSVDIE_POSITION               0x00000000
#define _U1OTGIE_VBUSVDIE_MASK                   0x00000001
#define _U1OTGIE_VBUSVDIE_LENGTH                 0x00000001

#define _U1OTGIE_SESENDIE_POSITION               0x00000002
#define _U1OTGIE_SESENDIE_MASK                   0x00000004
#define _U1OTGIE_SESENDIE_LENGTH                 0x00000001

#define _U1OTGIE_SESVDIE_POSITION                0x00000003
#define _U1OTGIE_SESVDIE_MASK                    0x00000008
#define _U1OTGIE_SESVDIE_LENGTH                  0x00000001

#define _U1OTGIE_ACTVIE_POSITION                 0x00000004
#define _U1OTGIE_ACTVIE_MASK                     0x00000010
#define _U1OTGIE_ACTVIE_LENGTH                   0x00000001

#define _U1OTGIE_LSTATEIE_POSITION               0x00000005
#define _U1OTGIE_LSTATEIE_MASK                   0x00000020
#define _U1OTGIE_LSTATEIE_LENGTH                 0x00000001

#define _U1OTGIE_T1MSECIE_POSITION               0x00000006
#define _U1OTGIE_T1MSECIE_MASK                   0x00000040
#define _U1OTGIE_T1MSECIE_LENGTH                 0x00000001

#define _U1OTGIE_IDIE_POSITION                   0x00000007
#define _U1OTGIE_IDIE_MASK                       0x00000080
#define _U1OTGIE_IDIE_LENGTH                     0x00000001

#define _U1OTGSTAT_VBUSVD_POSITION               0x00000000
#define _U1OTGSTAT_VBUSVD_MASK                   0x00000001
#define _U1OTGSTAT_VBUSVD_LENGTH                 0x00000001

#define _U1OTGSTAT_SESEND_POSITION               0x00000002
#define _U1OTGSTAT_SESEND_MASK                   0x00000004
#define _U1OTGSTAT_SESEND_LENGTH                 0x00000001

#define _U1OTGSTAT_SESVD_POSITION                0x00000003
#define _U1OTGSTAT_SESVD_MASK                    0x00000008
#define _U1OTGSTAT_SESVD_LENGTH                  0x00000001

#define _U1OTGSTAT_LSTATE_POSITION               0x00000005
#define _U1OTGSTAT_LSTATE_MASK                   0x00000020
#define _U1OTGSTAT_LSTATE_LENGTH                 0x00000001

#define _U1OTGSTAT_ID_POSITION                   0x00000007
#define _U1OTGSTAT_ID_MASK                       0x00000080
#define _U1OTGSTAT_ID_LENGTH                     0x00000001

#define _U1OTGCON_VBUSDIS_POSITION               0x00000000
#define _U1OTGCON_VBUSDIS_MASK                   0x00000001
#define _U1OTGCON_VBUSDIS_LENGTH                 0x00000001

#define _U1OTGCON_VBUSCHG_POSITION               0x00000001
#define _U1OTGCON_VBUSCHG_MASK                   0x00000002
#define _U1OTGCON_VBUSCHG_LENGTH                 0x00000001

