Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ64GC010.h
#define _ADSTATL_SLERR3_POSITION                 0x0000000B
#define _ADSTATL_SLERR3_MASK                     0x00000800
#define _ADSTATL_SLERR3_LENGTH                   0x00000001

#define _ADSTATL_SLOV_POSITION                   0x00000008
#define _ADSTATL_SLOV_MASK                       0x00000100
#define _ADSTATL_SLOV_LENGTH                     0x00000001

#define _ADSTATH_ADBUSY_POSITION                 0x00000000
#define _ADSTATH_ADBUSY_MASK                     0x00000001
#define _ADSTATH_ADBUSY_LENGTH                   0x00000001

#define _ADSTATH_ADREADY_POSITION                0x00000001
#define _ADSTATH_ADREADY_MASK                    0x00000002
#define _ADSTATH_ADREADY_LENGTH                  0x00000001

#define _ADSTATH_PUMPST_POSITION                 0x00000002
#define _ADSTATH_PUMPST_MASK                     0x00000004
#define _ADSTATH_PUMPST_LENGTH                   0x00000001

#define _ACCONL_COUNT_POSITION                   0x00000000
#define _ACCONL_COUNT_MASK                       0x000000FF
#define _ACCONL_COUNT_LENGTH                     0x00000008

#define _ACCONL_TBLSEL_POSITION                  0x00000008
#define _ACCONL_TBLSEL_MASK                      0x00003F00
#define _ACCONL_TBLSEL_LENGTH                    0x00000006

#define _ACCONL_COUNT0_POSITION                  0x00000000
#define _ACCONL_COUNT0_MASK                      0x00000001
#define _ACCONL_COUNT0_LENGTH                    0x00000001

#define _ACCONL_COUNT1_POSITION                  0x00000001
#define _ACCONL_COUNT1_MASK                      0x00000002
#define _ACCONL_COUNT1_LENGTH                    0x00000001

#define _ACCONL_COUNT2_POSITION                  0x00000002
#define _ACCONL_COUNT2_MASK                      0x00000004
#define _ACCONL_COUNT2_LENGTH                    0x00000001

#define _ACCONL_COUNT3_POSITION                  0x00000003
#define _ACCONL_COUNT3_MASK                      0x00000008
#define _ACCONL_COUNT3_LENGTH                    0x00000001

#define _ACCONL_COUNT4_POSITION                  0x00000004
#define _ACCONL_COUNT4_MASK                      0x00000010
#define _ACCONL_COUNT4_LENGTH                    0x00000001

#define _ACCONL_COUNT5_POSITION                  0x00000005
#define _ACCONL_COUNT5_MASK                      0x00000020
#define _ACCONL_COUNT5_LENGTH                    0x00000001

#define _ACCONL_COUNT6_POSITION                  0x00000006
#define _ACCONL_COUNT6_MASK                      0x00000040
#define _ACCONL_COUNT6_LENGTH                    0x00000001

#define _ACCONL_COUNT7_POSITION                  0x00000007
#define _ACCONL_COUNT7_MASK                      0x00000080
#define _ACCONL_COUNT7_LENGTH                    0x00000001

#define _ACCONL_TBLSEL0_POSITION                 0x00000008
#define _ACCONL_TBLSEL0_MASK                     0x00000100
#define _ACCONL_TBLSEL0_LENGTH                   0x00000001

#define _ACCONL_TBLSEL1_POSITION                 0x00000009
#define _ACCONL_TBLSEL1_MASK                     0x00000200
#define _ACCONL_TBLSEL1_LENGTH                   0x00000001

#define _ACCONL_TBLSEL2_POSITION                 0x0000000A
#define _ACCONL_TBLSEL2_MASK                     0x00000400
#define _ACCONL_TBLSEL2_LENGTH                   0x00000001

#define _ACCONL_TBLSEL3_POSITION                 0x0000000B
#define _ACCONL_TBLSEL3_MASK                     0x00000800
#define _ACCONL_TBLSEL3_LENGTH                   0x00000001

#define _ACCONL_TBLSEL4_POSITION                 0x0000000C
#define _ACCONL_TBLSEL4_MASK                     0x00001000
#define _ACCONL_TBLSEL4_LENGTH                   0x00000001

#define _ACCONL_TBLSEL5_POSITION                 0x0000000D
#define _ACCONL_TBLSEL5_MASK                     0x00002000
#define _ACCONL_TBLSEL5_LENGTH                   0x00000001

#define _ACCONH_ACIE_POSITION                    0x00000006
#define _ACCONH_ACIE_MASK                        0x00000040
#define _ACCONH_ACIE_LENGTH                      0x00000001

#define _ACCONH_ACEN_POSITION                    0x00000007
#define _ACCONH_ACEN_MASK                        0x00000080
#define _ACCONH_ACEN_LENGTH                      0x00000001

#define _ADCHITL_CHH0_POSITION                   0x00000000
#define _ADCHITL_CHH0_MASK                       0x00000001
#define _ADCHITL_CHH0_LENGTH                     0x00000001

#define _ADCHITL_CHH1_POSITION                   0x00000001
#define _ADCHITL_CHH1_MASK                       0x00000002
#define _ADCHITL_CHH1_LENGTH                     0x00000001

#define _ADCHITL_CHH2_POSITION                   0x00000002
#define _ADCHITL_CHH2_MASK                       0x00000004
#define _ADCHITL_CHH2_LENGTH                     0x00000001

#define _ADCHITL_CHH3_POSITION                   0x00000003
#define _ADCHITL_CHH3_MASK                       0x00000008
#define _ADCHITL_CHH3_LENGTH                     0x00000001

#define _ADCHITL_CHH4_POSITION                   0x00000004
#define _ADCHITL_CHH4_MASK                       0x00000010
#define _ADCHITL_CHH4_LENGTH                     0x00000001

#define _ADCHITL_CHH5_POSITION                   0x00000005
#define _ADCHITL_CHH5_MASK                       0x00000020
#define _ADCHITL_CHH5_LENGTH                     0x00000001

#define _ADCHITL_CHH6_POSITION                   0x00000006
#define _ADCHITL_CHH6_MASK                       0x00000040
#define _ADCHITL_CHH6_LENGTH                     0x00000001

#define _ADCHITL_CHH7_POSITION                   0x00000007
#define _ADCHITL_CHH7_MASK                       0x00000080
#define _ADCHITL_CHH7_LENGTH                     0x00000001

#define _ADCHITL_CHH8_POSITION                   0x00000008
#define _ADCHITL_CHH8_MASK                       0x00000100
#define _ADCHITL_CHH8_LENGTH                     0x00000001

#define _ADCHITL_CHH9_POSITION                   0x00000009
#define _ADCHITL_CHH9_MASK                       0x00000200
#define _ADCHITL_CHH9_LENGTH                     0x00000001

#define _ADCHITL_CHH10_POSITION                  0x0000000A
#define _ADCHITL_CHH10_MASK                      0x00000400
#define _ADCHITL_CHH10_LENGTH                    0x00000001

