Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ64GC010.h
#define _ADL2CONL_SLSIZE_POSITION                0x00000000
#define _ADL2CONL_SLSIZE_MASK                    0x0000003F
#define _ADL2CONL_SLSIZE_LENGTH                  0x00000006

#define _ADL2CONL_THSRC_POSITION                 0x00000007
#define _ADL2CONL_THSRC_MASK                     0x00000080
#define _ADL2CONL_THSRC_LENGTH                   0x00000001

#define _ADL2CONL_SLTSRC_POSITION                0x00000008
#define _ADL2CONL_SLTSRC_MASK                    0x00001F00
#define _ADL2CONL_SLTSRC_LENGTH                  0x00000005

#define _ADL2CONL_SLENCLR_POSITION               0x0000000D
#define _ADL2CONL_SLENCLR_MASK                   0x00002000
#define _ADL2CONL_SLENCLR_LENGTH                 0x00000001

#define _ADL2CONL_SAMP_POSITION                  0x0000000E
#define _ADL2CONL_SAMP_MASK                      0x00004000
#define _ADL2CONL_SAMP_LENGTH                    0x00000001

#define _ADL2CONL_SLEN_POSITION                  0x0000000F
#define _ADL2CONL_SLEN_MASK                      0x00008000
#define _ADL2CONL_SLEN_LENGTH                    0x00000001

#define _ADL2CONL_SLSIZE0_POSITION               0x00000000
#define _ADL2CONL_SLSIZE0_MASK                   0x00000001
#define _ADL2CONL_SLSIZE0_LENGTH                 0x00000001

#define _ADL2CONL_SLSIZE1_POSITION               0x00000001
#define _ADL2CONL_SLSIZE1_MASK                   0x00000002
#define _ADL2CONL_SLSIZE1_LENGTH                 0x00000001

#define _ADL2CONL_SLSIZE2_POSITION               0x00000002
#define _ADL2CONL_SLSIZE2_MASK                   0x00000004
#define _ADL2CONL_SLSIZE2_LENGTH                 0x00000001

#define _ADL2CONL_SLSIZE3_POSITION               0x00000003
#define _ADL2CONL_SLSIZE3_MASK                   0x00000008
#define _ADL2CONL_SLSIZE3_LENGTH                 0x00000001

#define _ADL2CONL_SLSIZE4_POSITION               0x00000004
#define _ADL2CONL_SLSIZE4_MASK                   0x00000010
#define _ADL2CONL_SLSIZE4_LENGTH                 0x00000001

#define _ADL2CONL_SLSIZE5_POSITION               0x00000005
#define _ADL2CONL_SLSIZE5_MASK                   0x00000020
#define _ADL2CONL_SLSIZE5_LENGTH                 0x00000001

#define _ADL2CONL_SLTSRC0_POSITION               0x00000008
#define _ADL2CONL_SLTSRC0_MASK                   0x00000100
#define _ADL2CONL_SLTSRC0_LENGTH                 0x00000001

#define _ADL2CONL_SLTSRC1_POSITION               0x00000009
#define _ADL2CONL_SLTSRC1_MASK                   0x00000200
#define _ADL2CONL_SLTSRC1_LENGTH                 0x00000001

#define _ADL2CONL_SLTSRC2_POSITION               0x0000000A
#define _ADL2CONL_SLTSRC2_MASK                   0x00000400
#define _ADL2CONL_SLTSRC2_LENGTH                 0x00000001

#define _ADL2CONL_SLTSRC3_POSITION               0x0000000B
#define _ADL2CONL_SLTSRC3_MASK                   0x00000800
#define _ADL2CONL_SLTSRC3_LENGTH                 0x00000001

#define _ADL2CONL_SLTSRC4_POSITION               0x0000000C
#define _ADL2CONL_SLTSRC4_MASK                   0x00001000
#define _ADL2CONL_SLTSRC4_LENGTH                 0x00000001

#define _ADL2CONH_SAMC_POSITION                  0x00000000
#define _ADL2CONH_SAMC_MASK                      0x0000001F
#define _ADL2CONH_SAMC_LENGTH                    0x00000005

#define _ADL2CONH_MULCHEN_POSITION               0x00000005
#define _ADL2CONH_MULCHEN_MASK                   0x00000020
#define _ADL2CONH_MULCHEN_LENGTH                 0x00000001

#define _ADL2CONH_PINTRIS_POSITION               0x00000006
#define _ADL2CONH_PINTRIS_MASK                   0x00000040
#define _ADL2CONH_PINTRIS_LENGTH                 0x00000001

#define _ADL2CONH_CTMEN_POSITION                 0x00000007
#define _ADL2CONH_CTMEN_MASK                     0x00000080
#define _ADL2CONH_CTMEN_LENGTH                   0x00000001

#define _ADL2CONH_CM_POSITION                    0x00000008
#define _ADL2CONH_CM_MASK                        0x00000700
#define _ADL2CONH_CM_LENGTH                      0x00000003

#define _ADL2CONH_WM_POSITION                    0x0000000B
#define _ADL2CONH_WM_MASK                        0x00001800
#define _ADL2CONH_WM_LENGTH                      0x00000002

#define _ADL2CONH_SLINT_POSITION                 0x0000000D
#define _ADL2CONH_SLINT_MASK                     0x00006000
#define _ADL2CONH_SLINT_LENGTH                   0x00000002

#define _ADL2CONH_ASEN_POSITION                  0x0000000F
#define _ADL2CONH_ASEN_MASK                      0x00008000
#define _ADL2CONH_ASEN_LENGTH                    0x00000001

#define _ADL2CONH_SAMC0_POSITION                 0x00000000
#define _ADL2CONH_SAMC0_MASK                     0x00000001
#define _ADL2CONH_SAMC0_LENGTH                   0x00000001

#define _ADL2CONH_SAMC1_POSITION                 0x00000001
#define _ADL2CONH_SAMC1_MASK                     0x00000002
#define _ADL2CONH_SAMC1_LENGTH                   0x00000001

#define _ADL2CONH_SAMC2_POSITION                 0x00000002
#define _ADL2CONH_SAMC2_MASK                     0x00000004
#define _ADL2CONH_SAMC2_LENGTH                   0x00000001

#define _ADL2CONH_SAMC3_POSITION                 0x00000003
#define _ADL2CONH_SAMC3_MASK                     0x00000008
#define _ADL2CONH_SAMC3_LENGTH                   0x00000001

#define _ADL2CONH_SAMC4_POSITION                 0x00000004
#define _ADL2CONH_SAMC4_MASK                     0x00000010
#define _ADL2CONH_SAMC4_LENGTH                   0x00000001

#define _ADL2CONH_CM0_POSITION                   0x00000008
#define _ADL2CONH_CM0_MASK                       0x00000100
#define _ADL2CONH_CM0_LENGTH                     0x00000001

#define _ADL2CONH_CM1_POSITION                   0x00000009
#define _ADL2CONH_CM1_MASK                       0x00000200
#define _ADL2CONH_CM1_LENGTH                     0x00000001

#define _ADL2CONH_CM2_POSITION                   0x0000000A
#define _ADL2CONH_CM2_MASK                       0x00000400
#define _ADL2CONH_CM2_LENGTH                     0x00000001

#define _ADL2CONH_WM0_POSITION                   0x0000000B
#define _ADL2CONH_WM0_MASK                       0x00000800
#define _ADL2CONH_WM0_LENGTH                     0x00000001

